Revit 2024 API
WireTypeSet.Erase Method
Removes a specified wire type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	WireType item
)
Visual Basic
Public Overridable Function Erase ( _
	item As WireType _
) As Integer
Visual C++
public:
virtual int Erase(
	WireType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.WireType
The wire type to be erased.
Return Value
The number of wire types that were erased from the set.
See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace